ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f358xx.h
#define ADC34_CCR_DELAY_Pos              (8U)                                  
#define ADC34_CCR_DELAY_Msk              (0xFU << ADC34_CCR_DELAY_Pos)         /*!< 0x00000F00 */
#define ADC34_CCR_DELAY                  ADC34_CCR_DELAY_Msk                   /*!< Delay between 2 sampling phases */
#define ADC34_CCR_DELAY_0                (0x1U << ADC34_CCR_DELAY_Pos)         /*!< 0x00000100 */
#define ADC34_CCR_DELAY_1                (0x2U << ADC34_CCR_DELAY_Pos)         /*!< 0x00000200 */
#define ADC34_CCR_DELAY_2                (0x4U << ADC34_CCR_DELAY_Pos)         /*!< 0x00000400 */
#define ADC34_CCR_DELAY_3                (0x8U << ADC34_CCR_DELAY_Pos)         /*!< 0x00000800 */

#define ADC34_CCR_DMACFG_Pos             (13U)                                 
#define ADC34_CCR_DMACFG_Msk             (0x1U << ADC34_CCR_DMACFG_Pos)        /*!< 0x00002000 */
#define ADC34_CCR_DMACFG                 ADC34_CCR_DMACFG_Msk                  /*!< DMA configuration for multi-ADC mode */
#define ADC34_CCR_MDMA_Pos               (14U)                                 
#define ADC34_CCR_MDMA_Msk               (0x3U << ADC34_CCR_MDMA_Pos)          /*!< 0x0000C000 */
#define ADC34_CCR_MDMA                   ADC34_CCR_MDMA_Msk                    /*!< DMA mode for multi-ADC mode */
#define ADC34_CCR_MDMA_0                 (0x1U << ADC34_CCR_MDMA_Pos)          /*!< 0x00004000 */
#define ADC34_CCR_MDMA_1                 (0x2U << ADC34_CCR_MDMA_Pos)          /*!< 0x00008000 */

#define ADC34_CCR_CKMODE_Pos             (16U)                                 
#define ADC34_CCR_CKMODE_Msk             (0x3U << ADC34_CCR_CKMODE_Pos)        /*!< 0x00030000 */
#define ADC34_CCR_CKMODE                 ADC34_CCR_CKMODE_Msk                  /*!< ADC clock mode */
#define ADC34_CCR_CKMODE_0               (0x1U << ADC34_CCR_CKMODE_Pos)        /*!< 0x00010000 */
#define ADC34_CCR_CKMODE_1               (0x2U << ADC34_CCR_CKMODE_Pos)        /*!< 0x00020000 */

#define ADC34_CCR_VREFEN_Pos             (22U)                                 
#define ADC34_CCR_VREFEN_Msk             (0x1U << ADC34_CCR_VREFEN_Pos)        /*!< 0x00400000 */
#define ADC34_CCR_VREFEN                 ADC34_CCR_VREFEN_Msk                  /*!< VREFINT enable */
#define ADC34_CCR_TSEN_Pos               (23U)                                 
#define ADC34_CCR_TSEN_Msk               (0x1U << ADC34_CCR_TSEN_Pos)          /*!< 0x00800000 */
#define ADC34_CCR_TSEN                   ADC34_CCR_TSEN_Msk                    /*!< Temperature sensor enable */
#define ADC34_CCR_VBATEN_Pos             (24U)                                 
#define ADC34_CCR_VBATEN_Msk             (0x1U << ADC34_CCR_VBATEN_Pos)        /*!< 0x01000000 */
#define ADC34_CCR_VBATEN                 ADC34_CCR_VBATEN_Msk                  /*!< VBAT enable */

/***************  Bit definition for ADC12_COMMON_CDR register  ***************/
#define ADC12_CDR_RDATA_MST_Pos          (0U)                                  
#define ADC12_CDR_RDATA_MST_Msk          (0xFFFFU << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x0000FFFF */
#define ADC12_CDR_RDATA_MST              ADC12_CDR_RDATA_MST_Msk               /*!< Regular Data of the master ADC */
#define ADC12_CDR_RDATA_MST_0            (0x0001U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000001 */
#define ADC12_CDR_RDATA_MST_1            (0x0002U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000002 */
#define ADC12_CDR_RDATA_MST_2            (0x0004U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000004 */
#define ADC12_CDR_RDATA_MST_3            (0x0008U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000008 */
#define ADC12_CDR_RDATA_MST_4            (0x0010U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000010 */
#define ADC12_CDR_RDATA_MST_5            (0x0020U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000020 */
#define ADC12_CDR_RDATA_MST_6            (0x0040U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000040 */
#define ADC12_CDR_RDATA_MST_7            (0x0080U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000080 */
#define ADC12_CDR_RDATA_MST_8            (0x0100U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000100 */
#define ADC12_CDR_RDATA_MST_9            (0x0200U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000200 */
#define ADC12_CDR_RDATA_MST_10           (0x0400U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000400 */
#define ADC12_CDR_RDATA_MST_11           (0x0800U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00000800 */
#define ADC12_CDR_RDATA_MST_12           (0x1000U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00001000 */
#define ADC12_CDR_RDATA_MST_13           (0x2000U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00002000 */
#define ADC12_CDR_RDATA_MST_14           (0x4000U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00004000 */
#define ADC12_CDR_RDATA_MST_15           (0x8000U << ADC12_CDR_RDATA_MST_Pos)  /*!< 0x00008000 */

#define ADC12_CDR_RDATA_SLV_Pos          (16U)                                 
#define ADC12_CDR_RDATA_SLV_Msk          (0xFFFFU << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0xFFFF0000 */
#define ADC12_CDR_RDATA_SLV              ADC12_CDR_RDATA_SLV_Msk               /*!< Regular Data of the master ADC */
#define ADC12_CDR_RDATA_SLV_0            (0x0001U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00010000 */
#define ADC12_CDR_RDATA_SLV_1            (0x0002U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00020000 */
#define ADC12_CDR_RDATA_SLV_2            (0x0004U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00040000 */
#define ADC12_CDR_RDATA_SLV_3            (0x0008U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00080000 */
#define ADC12_CDR_RDATA_SLV_4            (0x0010U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00100000 */
#define ADC12_CDR_RDATA_SLV_5            (0x0020U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00200000 */
#define ADC12_CDR_RDATA_SLV_6            (0x0040U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00400000 */
#define ADC12_CDR_RDATA_SLV_7            (0x0080U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x00800000 */
#define ADC12_CDR_RDATA_SLV_8            (0x0100U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x01000000 */
#define ADC12_CDR_RDATA_SLV_9            (0x0200U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x02000000 */
#define ADC12_CDR_RDATA_SLV_10           (0x0400U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x04000000 */
#define ADC12_CDR_RDATA_SLV_11           (0x0800U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x08000000 */
#define ADC12_CDR_RDATA_SLV_12           (0x1000U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x10000000 */
#define ADC12_CDR_RDATA_SLV_13           (0x2000U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x20000000 */
#define ADC12_CDR_RDATA_SLV_14           (0x4000U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x40000000 */
#define ADC12_CDR_RDATA_SLV_15           (0x8000U << ADC12_CDR_RDATA_SLV_Pos)  /*!< 0x80000000 */

/***************  Bit definition for ADC34_COMMON_CDR register  ***************/
#define ADC34_CDR_RDATA_MST_Pos          (0U)                                  
#define ADC34_CDR_RDATA_MST_Msk          (0xFFFFU << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x0000FFFF */
#define ADC34_CDR_RDATA_MST              ADC34_CDR_RDATA_MST_Msk               /*!< Regular Data of the master ADC */
#define ADC34_CDR_RDATA_MST_0            (0x0001U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000001 */
#define ADC34_CDR_RDATA_MST_1            (0x0002U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000002 */
#define ADC34_CDR_RDATA_MST_2            (0x0004U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000004 */
#define ADC34_CDR_RDATA_MST_3            (0x0008U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000008 */
#define ADC34_CDR_RDATA_MST_4            (0x0010U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000010 */
#define ADC34_CDR_RDATA_MST_5            (0x0020U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000020 */
#define ADC34_CDR_RDATA_MST_6            (0x0040U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000040 */
#define ADC34_CDR_RDATA_MST_7            (0x0080U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000080 */
#define ADC34_CDR_RDATA_MST_8            (0x0100U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000100 */
#define ADC34_CDR_RDATA_MST_9            (0x0200U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000200 */
#define ADC34_CDR_RDATA_MST_10           (0x0400U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000400 */
#define ADC34_CDR_RDATA_MST_11           (0x0800U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00000800 */
#define ADC34_CDR_RDATA_MST_12           (0x1000U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00001000 */
#define ADC34_CDR_RDATA_MST_13           (0x2000U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00002000 */
#define ADC34_CDR_RDATA_MST_14           (0x4000U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00004000 */
#define ADC34_CDR_RDATA_MST_15           (0x8000U << ADC34_CDR_RDATA_MST_Pos)  /*!< 0x00008000 */

