ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f358xx.h
/*********************  Bit definition for OPAMP3_CSR register  ***************/
#define OPAMP3_CSR_OPAMP3EN_Pos       (0U)                                     
#define OPAMP3_CSR_OPAMP3EN_Msk       (0x1U << OPAMP3_CSR_OPAMP3EN_Pos)        /*!< 0x00000001 */
#define OPAMP3_CSR_OPAMP3EN           OPAMP3_CSR_OPAMP3EN_Msk                  /*!< OPAMP3 enable */
#define OPAMP3_CSR_FORCEVP_Pos        (1U)                                     
#define OPAMP3_CSR_FORCEVP_Msk        (0x1U << OPAMP3_CSR_FORCEVP_Pos)         /*!< 0x00000002 */
#define OPAMP3_CSR_FORCEVP            OPAMP3_CSR_FORCEVP_Msk                   /*!< Connect the internal references to the plus input of the OPAMPX */
#define OPAMP3_CSR_VPSEL_Pos          (2U)                                     
#define OPAMP3_CSR_VPSEL_Msk          (0x3U << OPAMP3_CSR_VPSEL_Pos)           /*!< 0x0000000C */
#define OPAMP3_CSR_VPSEL              OPAMP3_CSR_VPSEL_Msk                     /*!< Non inverting input selection */
#define OPAMP3_CSR_VPSEL_0            (0x1U << OPAMP3_CSR_VPSEL_Pos)           /*!< 0x00000004 */
#define OPAMP3_CSR_VPSEL_1            (0x2U << OPAMP3_CSR_VPSEL_Pos)           /*!< 0x00000008 */
#define OPAMP3_CSR_VMSEL_Pos          (5U)                                     
#define OPAMP3_CSR_VMSEL_Msk          (0x3U << OPAMP3_CSR_VMSEL_Pos)           /*!< 0x00000060 */
#define OPAMP3_CSR_VMSEL              OPAMP3_CSR_VMSEL_Msk                     /*!< Inverting input selection */
#define OPAMP3_CSR_VMSEL_0            (0x1U << OPAMP3_CSR_VMSEL_Pos)           /*!< 0x00000020 */
#define OPAMP3_CSR_VMSEL_1            (0x2U << OPAMP3_CSR_VMSEL_Pos)           /*!< 0x00000040 */
#define OPAMP3_CSR_TCMEN_Pos          (7U)                                     
#define OPAMP3_CSR_TCMEN_Msk          (0x1U << OPAMP3_CSR_TCMEN_Pos)           /*!< 0x00000080 */
#define OPAMP3_CSR_TCMEN              OPAMP3_CSR_TCMEN_Msk                     /*!< Timer-Controlled Mux mode enable */
#define OPAMP3_CSR_VMSSEL_Pos         (8U)                                     
#define OPAMP3_CSR_VMSSEL_Msk         (0x1U << OPAMP3_CSR_VMSSEL_Pos)          /*!< 0x00000100 */
#define OPAMP3_CSR_VMSSEL             OPAMP3_CSR_VMSSEL_Msk                    /*!< Inverting input secondary selection */
#define OPAMP3_CSR_VPSSEL_Pos         (9U)                                     
#define OPAMP3_CSR_VPSSEL_Msk         (0x3U << OPAMP3_CSR_VPSSEL_Pos)          /*!< 0x00000600 */
#define OPAMP3_CSR_VPSSEL             OPAMP3_CSR_VPSSEL_Msk                    /*!< Non inverting input secondary selection */
#define OPAMP3_CSR_VPSSEL_0           (0x1U << OPAMP3_CSR_VPSSEL_Pos)          /*!< 0x00000200 */
#define OPAMP3_CSR_VPSSEL_1           (0x2U << OPAMP3_CSR_VPSSEL_Pos)          /*!< 0x00000400 */
#define OPAMP3_CSR_CALON_Pos          (11U)                                    
#define OPAMP3_CSR_CALON_Msk          (0x1U << OPAMP3_CSR_CALON_Pos)           /*!< 0x00000800 */
#define OPAMP3_CSR_CALON              OPAMP3_CSR_CALON_Msk                     /*!< Calibration mode enable */
#define OPAMP3_CSR_CALSEL_Pos         (12U)                                    
#define OPAMP3_CSR_CALSEL_Msk         (0x3U << OPAMP3_CSR_CALSEL_Pos)          /*!< 0x00003000 */
#define OPAMP3_CSR_CALSEL             OPAMP3_CSR_CALSEL_Msk                    /*!< Calibration selection */
#define OPAMP3_CSR_CALSEL_0           (0x1U << OPAMP3_CSR_CALSEL_Pos)          /*!< 0x00001000 */
#define OPAMP3_CSR_CALSEL_1           (0x2U << OPAMP3_CSR_CALSEL_Pos)          /*!< 0x00002000 */
#define OPAMP3_CSR_PGGAIN_Pos         (14U)                                    
#define OPAMP3_CSR_PGGAIN_Msk         (0xFU << OPAMP3_CSR_PGGAIN_Pos)          /*!< 0x0003C000 */
#define OPAMP3_CSR_PGGAIN             OPAMP3_CSR_PGGAIN_Msk                    /*!< Gain in PGA mode */
#define OPAMP3_CSR_PGGAIN_0           (0x1U << OPAMP3_CSR_PGGAIN_Pos)          /*!< 0x00004000 */
#define OPAMP3_CSR_PGGAIN_1           (0x2U << OPAMP3_CSR_PGGAIN_Pos)          /*!< 0x00008000 */
#define OPAMP3_CSR_PGGAIN_2           (0x4U << OPAMP3_CSR_PGGAIN_Pos)          /*!< 0x00010000 */
#define OPAMP3_CSR_PGGAIN_3           (0x8U << OPAMP3_CSR_PGGAIN_Pos)          /*!< 0x00020000 */
#define OPAMP3_CSR_USERTRIM_Pos       (18U)                                    
#define OPAMP3_CSR_USERTRIM_Msk       (0x1U << OPAMP3_CSR_USERTRIM_Pos)        /*!< 0x00040000 */
#define OPAMP3_CSR_USERTRIM           OPAMP3_CSR_USERTRIM_Msk                  /*!< User trimming enable */
#define OPAMP3_CSR_TRIMOFFSETP_Pos    (19U)                                    
#define OPAMP3_CSR_TRIMOFFSETP_Msk    (0x1FU << OPAMP3_CSR_TRIMOFFSETP_Pos)    /*!< 0x00F80000 */
#define OPAMP3_CSR_TRIMOFFSETP        OPAMP3_CSR_TRIMOFFSETP_Msk               /*!< Offset trimming value (PMOS) */
#define OPAMP3_CSR_TRIMOFFSETN_Pos    (24U)                                    
#define OPAMP3_CSR_TRIMOFFSETN_Msk    (0x1FU << OPAMP3_CSR_TRIMOFFSETN_Pos)    /*!< 0x1F000000 */
#define OPAMP3_CSR_TRIMOFFSETN        OPAMP3_CSR_TRIMOFFSETN_Msk               /*!< Offset trimming value (NMOS) */
#define OPAMP3_CSR_TSTREF_Pos         (29U)                                    
#define OPAMP3_CSR_TSTREF_Msk         (0x1U << OPAMP3_CSR_TSTREF_Pos)          /*!< 0x20000000 */
#define OPAMP3_CSR_TSTREF             OPAMP3_CSR_TSTREF_Msk                    /*!< It enables the switch to put out the internal reference */
#define OPAMP3_CSR_OUTCAL_Pos         (30U)                                    
#define OPAMP3_CSR_OUTCAL_Msk         (0x1U << OPAMP3_CSR_OUTCAL_Pos)          /*!< 0x40000000 */
#define OPAMP3_CSR_OUTCAL             OPAMP3_CSR_OUTCAL_Msk                    /*!< OPAMP ouput status flag */
#define OPAMP3_CSR_LOCK_Pos           (31U)                                    
#define OPAMP3_CSR_LOCK_Msk           (0x1U << OPAMP3_CSR_LOCK_Pos)            /*!< 0x80000000 */
#define OPAMP3_CSR_LOCK               OPAMP3_CSR_LOCK_Msk                      /*!< OPAMP lock */

/*********************  Bit definition for OPAMP4_CSR register  ***************/
#define OPAMP4_CSR_OPAMP4EN_Pos       (0U)                                     
#define OPAMP4_CSR_OPAMP4EN_Msk       (0x1U << OPAMP4_CSR_OPAMP4EN_Pos)        /*!< 0x00000001 */
#define OPAMP4_CSR_OPAMP4EN           OPAMP4_CSR_OPAMP4EN_Msk                  /*!< OPAMP4 enable */
#define OPAMP4_CSR_FORCEVP_Pos        (1U)                                     
#define OPAMP4_CSR_FORCEVP_Msk        (0x1U << OPAMP4_CSR_FORCEVP_Pos)         /*!< 0x00000002 */
#define OPAMP4_CSR_FORCEVP            OPAMP4_CSR_FORCEVP_Msk                   /*!< Connect the internal references to the plus input of the OPAMPX */
#define OPAMP4_CSR_VPSEL_Pos          (2U)                                     
#define OPAMP4_CSR_VPSEL_Msk          (0x3U << OPAMP4_CSR_VPSEL_Pos)           /*!< 0x0000000C */
#define OPAMP4_CSR_VPSEL              OPAMP4_CSR_VPSEL_Msk                     /*!< Non inverting input selection */
#define OPAMP4_CSR_VPSEL_0            (0x1U << OPAMP4_CSR_VPSEL_Pos)           /*!< 0x00000004 */
#define OPAMP4_CSR_VPSEL_1            (0x2U << OPAMP4_CSR_VPSEL_Pos)           /*!< 0x00000008 */
#define OPAMP4_CSR_VMSEL_Pos          (5U)                                     
#define OPAMP4_CSR_VMSEL_Msk          (0x3U << OPAMP4_CSR_VMSEL_Pos)           /*!< 0x00000060 */
#define OPAMP4_CSR_VMSEL              OPAMP4_CSR_VMSEL_Msk                     /*!< Inverting input selection */
#define OPAMP4_CSR_VMSEL_0            (0x1U << OPAMP4_CSR_VMSEL_Pos)           /*!< 0x00000020 */
#define OPAMP4_CSR_VMSEL_1            (0x2U << OPAMP4_CSR_VMSEL_Pos)           /*!< 0x00000040 */
#define OPAMP4_CSR_TCMEN_Pos          (7U)                                     
#define OPAMP4_CSR_TCMEN_Msk          (0x1U << OPAMP4_CSR_TCMEN_Pos)           /*!< 0x00000080 */
#define OPAMP4_CSR_TCMEN              OPAMP4_CSR_TCMEN_Msk                     /*!< Timer-Controlled Mux mode enable */
#define OPAMP4_CSR_VMSSEL_Pos         (8U)                                     
#define OPAMP4_CSR_VMSSEL_Msk         (0x1U << OPAMP4_CSR_VMSSEL_Pos)          /*!< 0x00000100 */
#define OPAMP4_CSR_VMSSEL             OPAMP4_CSR_VMSSEL_Msk                    /*!< Inverting input secondary selection */
#define OPAMP4_CSR_VPSSEL_Pos         (9U)                                     
#define OPAMP4_CSR_VPSSEL_Msk         (0x3U << OPAMP4_CSR_VPSSEL_Pos)          /*!< 0x00000600 */
#define OPAMP4_CSR_VPSSEL             OPAMP4_CSR_VPSSEL_Msk                    /*!< Non inverting input secondary selection */
#define OPAMP4_CSR_VPSSEL_0           (0x1U << OPAMP4_CSR_VPSSEL_Pos)          /*!< 0x00000200 */
#define OPAMP4_CSR_VPSSEL_1           (0x2U << OPAMP4_CSR_VPSSEL_Pos)          /*!< 0x00000400 */
#define OPAMP4_CSR_CALON_Pos          (11U)                                    
#define OPAMP4_CSR_CALON_Msk          (0x1U << OPAMP4_CSR_CALON_Pos)           /*!< 0x00000800 */
#define OPAMP4_CSR_CALON              OPAMP4_CSR_CALON_Msk                     /*!< Calibration mode enable */
#define OPAMP4_CSR_CALSEL_Pos         (12U)                                    
#define OPAMP4_CSR_CALSEL_Msk         (0x3U << OPAMP4_CSR_CALSEL_Pos)          /*!< 0x00003000 */
#define OPAMP4_CSR_CALSEL             OPAMP4_CSR_CALSEL_Msk                    /*!< Calibration selection */
#define OPAMP4_CSR_CALSEL_0           (0x1U << OPAMP4_CSR_CALSEL_Pos)          /*!< 0x00001000 */
#define OPAMP4_CSR_CALSEL_1           (0x2U << OPAMP4_CSR_CALSEL_Pos)          /*!< 0x00002000 */
#define OPAMP4_CSR_PGGAIN_Pos         (14U)                                    
#define OPAMP4_CSR_PGGAIN_Msk         (0xFU << OPAMP4_CSR_PGGAIN_Pos)          /*!< 0x0003C000 */
#define OPAMP4_CSR_PGGAIN             OPAMP4_CSR_PGGAIN_Msk                    /*!< Gain in PGA mode */
#define OPAMP4_CSR_PGGAIN_0           (0x1U << OPAMP4_CSR_PGGAIN_Pos)          /*!< 0x00004000 */
#define OPAMP4_CSR_PGGAIN_1           (0x2U << OPAMP4_CSR_PGGAIN_Pos)          /*!< 0x00008000 */
#define OPAMP4_CSR_PGGAIN_2           (0x4U << OPAMP4_CSR_PGGAIN_Pos)          /*!< 0x00010000 */
#define OPAMP4_CSR_PGGAIN_3           (0x8U << OPAMP4_CSR_PGGAIN_Pos)          /*!< 0x00020000 */
#define OPAMP4_CSR_USERTRIM_Pos       (18U)                                    
#define OPAMP4_CSR_USERTRIM_Msk       (0x1U << OPAMP4_CSR_USERTRIM_Pos)        /*!< 0x00040000 */
#define OPAMP4_CSR_USERTRIM           OPAMP4_CSR_USERTRIM_Msk                  /*!< User trimming enable */
#define OPAMP4_CSR_TRIMOFFSETP_Pos    (19U)                                    
#define OPAMP4_CSR_TRIMOFFSETP_Msk    (0x1FU << OPAMP4_CSR_TRIMOFFSETP_Pos)    /*!< 0x00F80000 */
#define OPAMP4_CSR_TRIMOFFSETP        OPAMP4_CSR_TRIMOFFSETP_Msk               /*!< Offset trimming value (PMOS) */
#define OPAMP4_CSR_TRIMOFFSETN_Pos    (24U)                                    
#define OPAMP4_CSR_TRIMOFFSETN_Msk    (0x1FU << OPAMP4_CSR_TRIMOFFSETN_Pos)    /*!< 0x1F000000 */
#define OPAMP4_CSR_TRIMOFFSETN        OPAMP4_CSR_TRIMOFFSETN_Msk               /*!< Offset trimming value (NMOS) */
#define OPAMP4_CSR_TSTREF_Pos         (29U)                                    
#define OPAMP4_CSR_TSTREF_Msk         (0x1U << OPAMP4_CSR_TSTREF_Pos)          /*!< 0x20000000 */
#define OPAMP4_CSR_TSTREF             OPAMP4_CSR_TSTREF_Msk                    /*!< It enables the switch to put out the internal reference */
#define OPAMP4_CSR_OUTCAL_Pos         (30U)                                    
#define OPAMP4_CSR_OUTCAL_Msk         (0x1U << OPAMP4_CSR_OUTCAL_Pos)          /*!< 0x40000000 */
#define OPAMP4_CSR_OUTCAL             OPAMP4_CSR_OUTCAL_Msk                    /*!< OPAMP ouput status flag */
#define OPAMP4_CSR_LOCK_Pos           (31U)                                    
#define OPAMP4_CSR_LOCK_Msk           (0x1U << OPAMP4_CSR_LOCK_Pos)            /*!< 0x80000000 */
#define OPAMP4_CSR_LOCK               OPAMP4_CSR_LOCK_Msk                      /*!< OPAMP lock */

